In [2]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Mike','Alice','Bob'],
    'age': [30,45,80],
    'job': ['Programmer','Designer','Accountant']
    }
)
df = df.set_index('name')
print(df)

       age         job
name
Mike    30  Programmer
Alice   45    Designer
Bob     80  Accountant

In [2]:
df = df.reset_index()
df = df.set_index('name')

In [3]:
df.loc['Alice','age']

np.int64(45)

In [4]:
df.iloc[1]

age          45
job    Designer
Name: Alice, dtype: object

In [5]:
df.at['Alice','age']

np.int64(45)

In [6]:
df.iat[1,0 ]

np.int64(45)

In [10]:
df.at['Mike','age']=60

In [12]:
df.loc['Alice']= [57,'Clerk']

In [13]:
df

       age         job
name
Mike    60  Programmer
Alice   57       Clerk
Bob     80  Accountant

In [14]:
df.loc['Salohiddin']= [19,'ML engineer']

In [15]:
df

            age          job
name
Mike         60   Programmer
Alice        57        Clerk
Bob          80   Accountant
Salohiddin   19  ML engineer

In [18]:
df.iloc[0:4,1]

name
Mike           Programmer
Alice               Clerk
Bob            Accountant
Salohiddin    ML engineer
Name: job, dtype: object

In [19]:
df['age'] = df.age *2

In [21]:
df['age'] = df.age /2

In [22]:
df

             age          job
name
Mike        60.0   Programmer
Alice       57.0        Clerk
Bob         80.0   Accountant
Salohiddin  19.0  ML engineer